{"id":"1435493","aboutText":"<h2>We are creating global opportunities with unrelenting passion and perseverance driven by our entrepreneurial spirit.</h2>\n<p>We are forging profitable partnerships at home and around the world. And while our company is breaking new ground in the cannabis market, our experienced team demonstrates the discipline and knowledge that is at the heart of our successful business.</p>\n<p>As growers, we are recognized for our cultivation techniques and plants that set the standard for clean, pure, quality cannabis. But we don&rsquo;t stop there. We acknowledge the responsibility in front of us &ndash; to define an industry through thought leadership, innovative product development and engaged partnerships.</p>\n<p><strong>We are New Maple. Grow with us.</strong></p>","leadershipTeam":[{"id":"1435492","name":"Tegan Adams","twitterUrl":"","linkedinUrl":"","jobTitle":"CEO","instagramUrl":"","facebookUrl":"","bio":"<p><b>Tegan Adams is an industry veteran and global leader in cannabis.</b><span>&nbsp;</span>Tegan holds a BSc &amp; MSc from UBC in Agricultural Economics. She has 10 years management consulting, research and teaching experience, starting in the cannabis industry in 2014, she successfully guided the launch of many of the first public and privately held cannabis companies in Canada. Following her successes, Tegan pitched and co-launched Canada's first cannabis university course, teaching over 400 students in the first year. Working as a Director at a Health Canada accredited lab in Toronto, she's been involved in reviewing and visiting over one hundred cannabis companies for business planning and licensing submissions, all of which have been successful.</p>\n<p>After vetting many of the existing cannabis companies, she stands strong as the CEO for New Maple Holdings as the top choice for operational success and investment strategy. Tegan is working to expand New Maple's footprint as a global leader in GMP supply chain management to support the world's top brands. The company operates with over 1.5M ft2 of available production space in the Toronto area of Ontario, Canada.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1567480243-tegan-adams.jpg"}},{"id":"1435507","name":"Chetan Dhotre","twitterUrl":"","linkedinUrl":"","jobTitle":"Title","instagramUrl":"","facebookUrl":"","bio":"<p><b>Chetan Dhotre has over 19 years of experience in global operations and engineering.</b><span>&nbsp;</span>Chetan has an MBA from the Rotman School of Management at the University of Toronto, and is a mechanical engineer. He has led global teams spanning 16 facilities in the Americas, Europe and Asia in diverse industries including, biotechnology, composites, and chemical manufacturing. He has successfully delivered multimillion dollar capital projects globally and has a proven record of turning underperforming operations to best in class.</p>\n<p>Chetan comes to New Maple from Sanofi Pasteur Limited, where he was the Head of Engineering. As Chief Operating Officer at New Maple, he is responsible for the overall operational management of the company.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1567480727-chetan-dhotre.jpg"}},{"id":"1435538","name":"Don-Shane Taylor","twitterUrl":"","linkedinUrl":"","jobTitle":"TITLE","instagramUrl":"","facebookUrl":"","bio":"<p>Over seven years of operational experience in Canada&rsquo;s federally legal cannabis sector. Licensing success in two leading Canadian LPs: MedReleaf and Northern Green Canada.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1567489556-don-shane-taylor.jpg"}},{"id":"1435539","name":"Rhonda Gerrits","twitterUrl":"","linkedinUrl":"","jobTitle":"TITLE","instagramUrl":"","facebookUrl":"","bio":"<p><strong>Rhonda Gerrits has over 18 years experience in food and regulated industries.</strong> Rhonda holds a BSc in Food Science focused in Microbiology and Quality from the University of Guelph. She is certified in HACCP and SQF as well as Canadian food labeling guidelines and environmental monitoring. She has worked in a variety of roles including Food Safety Coordinator and SQF practitioner with Woolwich Dairy as well as as a Researcher with the University of Guelph.</p>\n<p>Before joining New Maple, Rhonda was a Professor in the Institute of Food Processing and Technology at Conestoga College, teaching in the Food Processing Technician and Food Safety, Quality Assurance graduate program. At New Maple - Rhonda works to ensure a constant focus on quality and GMP.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1567489577-rhonda-gerrits.jpg"}},{"id":"1435540","name":"Mark Ian Mitchell","twitterUrl":"","linkedinUrl":"","jobTitle":"TITLE","instagramUrl":"","facebookUrl":"","bio":"<p><strong>Mark Ian Mitchell has over 33 years of experience in regulatory affairs.</strong> Mark spent twelve years as a Primary Products Inspector for CFIA where he participated in the very first HACCP training and implementation at several Federal establishments in Ontario.</p>\n<p>Switching from the Federal to Provincial systems to work with the Meat Inspection Program(MIP), Ontario Ministry of Food and Rural Affairs (OMAFRA), Mark went from the front line to the head office were he lead a technology team and implemented strategies to modernize data collection and secure data storage for all of the food regulatory inspection regimes in the Province. Furthering his leadership skills, Mark took the position of Area Manager Stratford where he managed a team of 18 who were located in 40 different third-party locations. In his twenty years of leadership and management, Mark lead initiatives which transformed the FIP resulting in him being formally recognized through the Premieres Amethyst Award for dedicated efforts to Food Safety and the Environment.</p>\n<p>At New Maple, Mark is an integral part of the team - Maintaining our focus on quality assurance and control.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1568137223-ian-mitchell.jpg"}},{"id":"1435541","name":"Karim Nehme","twitterUrl":"","linkedinUrl":"","jobTitle":"PRESIDENT","instagramUrl":"","facebookUrl":"","bio":"<p><strong>Karim Nehme is the President, Co-Founder and a Member of the Board for New Maple Holdings.</strong> Karim holds an HBA from the University of Toronto and an MBA from the Schulich School of Business (with distinction). He is skilled at implementing ISO 9001 quality assurance standards and has experience preparing bids for USD 20 billion + worth of projects with AECOM.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1567489626-karim-nehme.jpg"}},{"id":"1435542","name":"Miki Batch","twitterUrl":"","linkedinUrl":"","jobTitle":"VP BUSINESS DEVELOPMENT","instagramUrl":"","facebookUrl":"","bio":"<p><strong>Miki Batch is the Vice President of Business Development, Founder and a Member of the Board for New Maple Holdings.</strong> Miki holds an HBA in Economics and a Certificate in Business Analysis from the University of Toronto. Miki has specialized international experience in the energy, construction and food processing sectors. He also has rounded experience in the operation of private medium sized enterprises. As one of the main Founders of New Maple - Miki brings his family ties to the Carribean as well as high net worth contacts around the world.</p>","headshot":{"url":"https://www.datocms-assets.com/15765/1567489650-miki-batch.jpg"}}],"footprintLocations":[{"bulletPoints":"<ul>\n<li><strong>1.25 million sq. ft </strong>hydroponic greenhouse.</li>\n<li><strong>45 minutes </strong>to the US-Canada border.</li>\n<li><strong>Partnership arrangement.&sup2;</strong></li>\n</ul>","description":"<h5>( Headline Goes Here )</h5>\n<div>\n<p>New Maple is entering into a partnership with Allegro Acres under to convert and operate Allegro&rsquo;s existing 1.25 million sq. ft greenhouse for cannabis cultivation.&sup1; Allegro is owned and managed by third generation greenhouse growers who have been active members of Ontario&rsquo;s agricultural community since the 1950s.</p>\n</div>","id":"1435499","anchor":"allegro","image1":{"url":"https://www.datocms-assets.com/15765/1567480972-allegro.jpg"},"image2":null,"location":"Leamington, ON","externalUrl":"","logo":{"url":"https://www.datocms-assets.com/15765/1567480889-allegro-acres-logo-2x.png"},"title":"ALLEGRO"},{"bulletPoints":"<ul>\n<li><strong>23 acre, riverfront site: </strong>10,000 sq. ft Phase 1.</li>\n<li><strong>1.5 hours </strong>from downtown Toronto.</li>\n<li><strong>Wholly-owned </strong>license applicant.</li>\n</ul>","description":"<h5>License Progress</h5>\n<div>\n<p>On 8 May 2019, Health Canada announced changes to the cannabis licensing process, bringing requirements more in line with the pharmaceutical industry. Effective immediately, new applicants must have a fully built site that meets all the requirements of the Cannabis Regulations at the time of their application.&sup1;</p>\n<p>This development is favourable to Canwe as its phase one facility is largely complete, placing it ahead of many applicants who do not yet have a building. Health Canada is expected to prioritize applicants with ready-built facilities, leading to a more efficient and streamlined licensing process.</p>\n</div>","id":"1435500","anchor":"canwe","image1":{"url":"https://www.datocms-assets.com/15765/1567481026-canwe-1.jpg"},"image2":{"url":"https://www.datocms-assets.com/15765/1567481029-canwe-2.jpg"},"location":"North West of Toronto","externalUrl":"","logo":{"url":"https://www.datocms-assets.com/15765/1567480986-canwe-logo-2x.png"},"title":"CANWE"},{"bulletPoints":"<ul>\n<li><strong>Licensed producer </strong>on 12 acre industrial site.</li>\n<li><strong>10 minutes </strong>from Toronto Pearson Airport.</li>\n<li><strong>Consulting arrangement </strong>with equity stake.</li>\n</ul>","description":"<h5>A Federally Licensed Cannabis Producer</h5>\n<div>\n<p>On 8 May 2019, Health Canada announced changes to the cannabis licensing process, bringing requirements more in line with the pharmaceutical industry. Effective immediately, new applicants must have a fully built site that meets all the requirements of the Cannabis Regulations at the time of their application.</p>\n<ul>\n<li>Licensed producer (LP) with 7 operational cultivation rooms.</li>\n<li>Currently selling to the Ontario Cannabis Store (OCS), authorized retail cannabis stores, and medical patients.</li>\n<li>Wholly-owned sciences division dedicated to medical research in opioid substitution and pain management.</li>\n<li>Serviced by five major highways in Canada&rsquo;s most populous region.</li>\n<li>Two level 9 vaults, minutes from Toronto Pearson International Airport (ideal for export).</li>\n<li>12-acre industrial site, award-winning 90,000 sq. ft. building with room for expansion.</li>\n</ul>\n</div>","id":"1435501","anchor":"northerngreen","image1":{"url":"https://www.datocms-assets.com/15765/1567481157-ngc.jpg"},"image2":null,"location":"Toronto, ON","externalUrl":"http://www.northerngreencanada.com","logo":{"url":"https://www.datocms-assets.com/15765/1567491784-ngc-logo-2x.png"},"title":"NORTHERN GREEN CANADA"}],"investorsBlocks":[{"id":"1435496","image":{"url":"https://www.datocms-assets.com/15765/1568138492-buildings.jpg"},"text":"<h4>Private equity firms typically have a longer term strategic outlook as compared to their public company counterparts.</h4>\n<p>This allows private companies to focus on growing their operations organically and develop sustainable business models that drive value creation and profitability.</p>"},{"id":"1435497","image":{"url":"https://www.datocms-assets.com/15765/1568138504-buildings-2.jpg"},"text":"<p>With only one class of common shares, New Maple&rsquo;s structure is simple and transparent &mdash; everyone&rsquo;s interests are aligned with the success of the company. Seize the opportunity to invest in New Maple and gain exposure to leading industry expertise.</p>\n<p><strong>Invest in New Maple and Grow with Us.</strong></p>"}],"technicalTeamImage":{"url":"https://www.datocms-assets.com/15765/1567489368-growers.jpg"},"technicalTeamFootnotes":"<ol>\n<li>Members of the team have worked for MedReleaf, Flowr, and Northern Green Canada</li>\n<li>MedReleaf won several Canadian Cannabis Awards in 2014, 2015, and 2016</li>\n<li>Annual crop yields of 300 grams/sq ft of grow space were more than double the industry average according to a 2017 report by PI Financial</li>\n<li>As the date of this document. In the past, product was voluntarily irradiated only at the request of the patients</li>\n</ol>","technicalTeamIcons":[{"id":"1435502","svg":{"url":"https://www.datocms-assets.com/15765/1567480767-handleaf.svg"},"text":"Over 30 years of combined federal cannabis cultivation experience"},{"id":"1435503","svg":{"url":"https://www.datocms-assets.com/15765/1567480785-lps.svg"},"text":"Successfully helped license and operate 3 of Canada’s leading LPs[1]"},{"id":"1435504","svg":{"url":"https://www.datocms-assets.com/15765/1567480815-award.svg"},"text":"Grew award-winning flower that sold for as high as $17.50/gram[2]"},{"id":"1435505","svg":{"url":"https://www.datocms-assets.com/15765/1567480830-crop.svg"},"text":"Achieved annual crop yields more than double the industry average[3]"},{"id":"1435506","svg":{"url":"https://www.datocms-assets.com/15765/1567480842-lab.svg"},"text":"Free of recalls, lab test failures, and irradiated product[4]"}],"technicalTeamIntro":"<h3 data-v-ce3049a0=\"\">More than just growers</h3>\n<p data-v-ce3049a0=\"\">New Maple&rsquo;s technical team are unlike any other in the industry. With shared experience as the principal production team at MedReleaf (acquired by Aurora in May 2018 for $3.2 billion), each member has a proven track record of excellence in cannabis production and processing, giving New Maple unparalleled seed-to-sale in-house expertise.</p>","advisoryBoard":[{"id":"1435529","bio":"<p>Philanthropist, entrepreneur, and New Maple investor. The last Undisputed Heavyweight Champion of the World.</p>","facebookUrl":"","headshot":{"url":"https://www.datocms-assets.com/15765/1567488999-lennox-lewis.jpg"},"instagramUrl":"","jobTitle":"PROFESSIONAL BOXER","linkedinUrl":"","name":"Lennox Lewis","twitterUrl":""},{"id":"1435530","bio":"<p>Corporate securities lawyer maintaining a specialty practice in cannabis regulation. Guest writer for the Globe and Mail.</p>","facebookUrl":"","headshot":{"url":"https://www.datocms-assets.com/15765/1567489025-andrea-hill.jpg"},"instagramUrl":"","jobTitle":"LAWYER AT SKYLAW","linkedinUrl":"","name":"Andrea Hill","twitterUrl":""},{"id":"1435531","bio":"<p>25+ years experience in wealth management, including private banking, impact investing, and family offices.</p>","facebookUrl":"","headshot":{"url":"https://www.datocms-assets.com/15765/1567489060-carol-pepper.jpg"},"instagramUrl":"","jobTitle":"CEO, PEPPER INTERNATIONAL","linkedinUrl":"","name":"Carol Pepper","twitterUrl":""},{"id":"1435532","bio":"<p>Tenured professor and researcher at the University of British Columbia, specialising in Horticulture, Plant Nutrition, and Sustainable Production Systems.</p>","facebookUrl":"","headshot":{"url":"https://www.datocms-assets.com/15765/1567489077-dr-andrew-riseman.jpg"},"instagramUrl":"","jobTitle":"PROFESSOR AT UBC","linkedinUrl":"","name":"Dr. Andrew Riseman","twitterUrl":""}]}
